runtime ./plug.vim

"=====================================================================
" Settings
"=====================================================================

"---------------------------------------------------------------------
" Variables
"
"определить runtimepath ($HOME/.vim)
let $RTP=split(&runtimepath, ',')[0]
let $RC="$HOME/.config/nvim/init.vim"
let $CONF="$HOME/.config/nvim/"
let $NOTES="$HOME/Documents/notes/"

" устанавливаем path для поиска файлов в проекте
set path=.,**

"---------------------------------------------------------------------
syntax on

"Поддержка мыши
set mouse=a

" Включаем 256 цветов в терминале
set t_Co=256

"Кодировка терминала
set termencoding=utf-8

" Кодировка файлов по умолчанию
set encoding=utf-8
set fileencodings=utf8,cp1251

"---------------------------------------------------------------------
" Определение русской раскладки
set keymap=russian-jcukenwin
" При запуске vim использовать en раскладку
set iminsert=0

"---------------------------------------------------------------------
" Нумерация строк
set number
set relativenumber

"---------------------------------------------------------------------
set scrolloff=7
set tabstop=4
set shiftwidth=4
" set smarttab
"Ставим табы пробелами
set expandtab
" Вырубаем черточки на табах
set showtabline=1
" Автоотступ
" set autoindent
" Отключить автокомментарий
set formatoptions-=cro

"---------------------------------------------------------------------
" Переносим на другую строчку, разрываем строки
set wrap
" set linebreak

"---------------------------------------------------------------------
" Не подсвечивать результаты поиска
set nohlsearch
"Инкрементный поиск
set incsearch
" Игнорировать регистр при поиске
set ignorecase

"---------------------------------------------------------------------
" Удобное поведение backspace
set backspace=indent,eol,start

"---------------------------------------------------------------------
" Вырубаем .swp и ~ (резервные) файлы
set nobackup
set noswapfile

"---------------------------------------------------------------------

"Интерпретация чисел ведущим нулем как десятичные
set nrformats=

"---------------------------------------------------------------------
set clipboard=unnamed
set textwidth=80
set ruler

"---------------------------------------------------------------------
" Чтобы переключаться между буферами без сохранения
set hidden
" Не выводить сообщения об ошибке при попытке закрыть(удалить) буфер с
" не сохраненными изменениями. Вместо ошибки будет появляться подтверждение
" закрытия не сохраненного файла.
set confirm

"---------------------------------------------------------------------
" Понижаем задержку ввода escape последовательносей
set ttimeoutlen=10

" Увеличить кол-во последних запоминаемых команд
set history=200

"=====================================================================
"mappings
"=====================================================================
"Изменение <Leader> с \ на ,
let mapleader=","

"---------------------------------------------------------------------
" Netrw
nnoremap <C-e> :Ex<CR>

"---------------------------------------------------------------------
"Переключение раскладки с помоьщью <C-l>
imap <C-l> <C-^>
"Для командного режима
cmap <silent> <C-l> <C-^>
"---------------------------------------------------------------------

" %% - в командном режиме подставить путь к файлу
cnoremap <expr> %% getcmdtype() == ":" ? expand('%:h').'/':'%%'
"---------------------------------------------------------------------
"Перемещение курсора в режиме insert
"На символ вправо
inoremap <C-f> <C-o>a
"В конец строки
inoremap <C-e> <C-o>A
"В начало строки
inoremap <C-a> <C-o>I
"Удалить символ справа
inoremap <C-d> <Delete>

"---------------------------------------------------------------------
"для работы с буфером обмена
noremap <Leader>y "+y
noremap <Leader>p "+p
noremap <Leader>Y "*y
noremap <Leader>P "*p

"---------------------------------------------------------------------
"Изменение \ на , (для поиска в симв. в обр. напр.)
nnoremap \ ,

"---------------------------------------------------------------------
" Курсор
:set guicursor=n-v-c:block,i-ci-ve:ver25,r-cr:hor20,o:hor50
  \,i-r:blinkwait700-blinkoff400-blinkon250-Cursor/lCursor
  \,sm:block-blinkwait175-blinkoff150-blinkon175

